Vel11leV/testTask_STM32/Src/main.c
}

void espReplyClear()
{
   
    for(int i=0;i<ESPBUF;i++)
    {
        espReply[i]=NULL;
    }
    espCount = 0;

}

int8_t espReplyIsSubstring(uint8_t *subStr, uint16_t theSubstrlen)
{
if  ( subStr==NULL) return -1;
    
    for(int i=0;i<(ESPBUF-theSubstrlen+1);i++)
    {
        for(int j=0;j<theSubstrlen;j++)
        {
            if (espReply[i+j]!=subStr[j])
                break;
            if (j==theSubstrlen-1)
            {
                
                uint8_t status []="\nStatus: ";
                uint8_t nLine []="\n";
                /*
                HAL_UART_Transmit(&huart2,status,9,10);
                HAL_UART_Transmit(&huart2,subStr, theSubstrlen,10);
                HAL_UART_Transmit(&huart2,nLine,1,10);
                */
                strSendUART2(status,STRLEN(status));
                strSendUART2(subStr,theSubstrlen);
                strSendUART2(nLine,STRLEN(nLine));
                
                return 1;
                
            }
        }
        if (i==ESPBUF-theSubstrlen)
                return 0;
    }    
      
}

int8_t sendRequest(uint8_t *request, uint8_t theStrlen)
{
    if(request==NULL) return -1;
    
    if (theStrlen>ATSENDSIZE){ uint8_t error[] = "ERROR: Message was not sent, it is too long ...\n";  strSendUART2(error,STRLEN(error)); return 0;}
    if (theStrlen==0){ uint8_t error[] = "ERROR: No data to send ...\n";  strSendUART2(error,STRLEN(error)); return 0;}
   
        
    uint8_t AT_CIPSEND[] =  "AT+CIPSEND="; //AT+CIPSEND=48\r\n;  ATSENDSIZE max via one transaction
    uint8_t AT_END [] = "\r\n";
    uint8_t rep1[] ="OK";
    uint8_t _WAIT[] ="Waiting for AT reply ...\n";  
    
    uint8_t numb [3] ={' ',' ',' '};     
    uintToString(theStrlen,numb,sizeof(theStrlen)); 
    int sizeOfNumb=3;
    for(int i=0;i<3;i++)
    {
     if( numb[i]==' ') --sizeOfNumb;
     else break;
    }
    
     uint8_t length = STRLEN(AT_CIPSEND)-1+sizeOfNumb+2;   
     uint8_t *AT_CIPSEND_NUMB_ENDL = (uint8_t *)malloc(length);
    
     uint8_t *DATA = (uint8_t *)malloc(theStrlen);
     for(int i=0;i<theStrlen;i++)
        {DATA[i]=*(request++);}
    
       int i=0;     
                for(int j=0; j<sizeof(AT_CIPSEND)-1; j++)
                {
                    AT_CIPSEND_NUMB_ENDL[i]=AT_CIPSEND[j];
                    i++;
                }                              
                for(int j=STRLEN(numb)-sizeOfNumb; j<STRLEN(numb); j++)
                {
                    AT_CIPSEND_NUMB_ENDL[i]=numb[j];
                    i++;
                }
                for(int j=0;j<STRLEN(AT_END)-1;j++)
                {
                    AT_CIPSEND_NUMB_ENDL[i]=AT_END[j];
                    i++;
                }
                
   espReplyClear(); 
               
   
   strSendUART2(AT_CIPSEND_NUMB_ENDL,length); 
   strSendUART2(DATA,theStrlen);                 
               
                
    strSendUART1(AT_CIPSEND_NUMB_ENDL,length);  
        while(espReplyIsSubstring(rep1,2)==0){ 
                //strSendUART2(_WAIT,STRLEN(_WAIT));
      
                }
   espReplyToUART2();     
   espReplyClear(); 
           
   strSendUART1(DATA,theStrlen); 
        while(espReplyIsSubstring(rep1,2)==0){ 
               // strSendUART2(_WAIT,STRLEN(_WAIT));     
                }
 
   espReplyToUART2();     
   espReplyClear();  
                
       free (AT_CIPSEND_NUMB_ENDL); 
       free (DATA);   
       
return 1;
}




int8_t sendRequestAnySize(uint8_t *request, uint16_t theStrlen)
{
    
    if(request==NULL) return -1;
    
    uint16_t remainder=0;
    uint16_t whole=0;
    
    remainder = theStrlen%ATSENDSIZE;
    whole = (uint16_t)(theStrlen/ATSENDSIZE);
    
    int i=0;
    for(;i<whole; i++)
    {
        sendRequest(request+i*ATSENDSIZE, ATSENDSIZE);
    }
    
    if (remainder>0&&whole>0)
    {
        i++;
        sendRequest(request+i*ATSENDSIZE, remainder);
    }
    else if(remainder>0&&whole==0)
    { sendRequest(request, remainder);}
      
    return 1;
}






/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
uint8_t myDataRX2  [SIZEUART2RES];
uint8_t myDataRX1  [SIZEUART1RES];

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART2_UART_Init();
  MX_USART1_UART_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */
  HAL_UART_Receive_DMA(&huart2,myDataRX2, SIZEUART2RES);
  HAL_UART_Receive_DMA(&huart1,myDataRX1, SIZEUART1RES);
  
  
  
 
  /* USER CODE END 2 */

  /* Create the mutex(es) */
  /* definition and creation of dataMutex01 */
  osMutexDef(dataMutex01);
  dataMutex01Handle = osMutexCreate(osMutex(dataMutex01));

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, sensorThread1, osPriorityNormal, 0, 128);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of myTask02 */
  osThreadDef(myTask02, serverThread2, osPriorityIdle, 0, 528);
  myTask02Handle = osThreadCreate(osThread(myTask02), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

