Vel11leV/testTask_STM32/Src/main.c
MQTTPacket_connectData data = MQTTPacket_connectData_initializer;
uint16_t rc = 0;
uint8_t buf[200];
int buflen = sizeof(buf);    
MQTTString topicString = MQTTString_initializer;
uint8_t payload[100];
data.clientID.cstring = MQTTID;
data.keepAliveInterval = 20;
data.cleansession = 1;
topicString.cstring = MQTTTOPIC;
    
//////////////////endMQTT///////////////////
    
    
  /* USER CODE BEGIN serverThread2 */
  /* Infinite loop */
       

    uint8_t AT_RST[]    = "AT+RST\r\n";
    uint8_t AT_CIPMODE[]= "AT+CIPMODE=1\r\n";
    uint8_t AT_CIPSEND[]= "AT+CIPSEND\r\n";
    uint8_t AT_CIFSR[]  = "AT+CIFSR\r\n";
    uint8_t AT_CIPMODECLOSE[3]={'+','+','+'};
    uint8_t AT_CONNECT_TO_SERVER[]=  "AT+CIPSTART=\"TCP\",\"quickstart.messaging.internetofthings.ibmcloud.com\",1883\r\n"; 
    sprintf((char *)AT_SSID_CON_,"AT+CWJAP=\"%s\",\"%s\"\r\n",SSID,PASS);
   
    
    //strSendUART2(AT_SSID_CON_,STRLEN(AT_SSID_CON_));

    
//////////////////////////////////////////    
    ////////////ESP8266 status////////////
    uint8_t _WAIT_WIFI[]      ="connecting to WiFi...\n";
    uint8_t _WAIT_IP[]        ="getting IP...\n";
    uint8_t _WAIT_SERVERCON[] ="Connecting to the server...\n";  
    uint8_t _WIFI_connected[] ="WiFi connected.\n";
    uint8_t _WAIT_CIPMODE[]   ="CIPMODE...\n"; 
    
    ////////////ESP8266 reply////////////
    uint8_t rep_OK[] =     "OK";
    uint8_t rep_STAIP[] =  "STAIP";
    uint8_t rep_CONNECT[]= "CONNECT";
    uint8_t rep_CIPSEND[]= ">";
    uint8_t _WAIT_CIPSEND[] ="SIPMODE ON\n"; 
    uint8_t NEWLINE[] ="\n";
///////////////////////////////////////////    
    

       
/*---------------------ESP8266 setting---------------------*/   

espReplyClear(); 
strSendUART1(AT_CIPMODECLOSE,STRLEN(AT_CIPMODECLOSE));
HAL_Delay(2000);        

    //connectiong to WiFi AP
      espReplyClear();    
      strSendUART1(AT_SSID_CON_,STRLEN(AT_SSID_CON_)-1);
      while(espReplyIsSubstring(rep_OK,STRLEN(rep_OK)-1)==0){ 
            espReplyClear();
            strSendUART1(AT_CIFSR,STRLEN(AT_CIFSR)-1);
            strSendUART2( _WAIT_WIFI,STRLEN( _WAIT_WIFI));
            HAL_Delay(300);         
            }
           

    //GET IP        
    while(espReplyIsSubstring(rep_STAIP,STRLEN(rep_STAIP)-1)==0){ 
            espReplyToUART2();
            espReplyClear();
            strSendUART1(AT_CIFSR,STRLEN(AT_CIFSR));
            strSendUART2(_WAIT_IP,STRLEN(_WAIT_IP));
            HAL_Delay(300);         
            }
    espReplyToUART2();          
    espReplyClear(); 

    
   //set ESP8266 set in CIPMODE (uart<->WiFi)         
   strSendUART1(AT_CIPMODE,STRLEN(AT_CIPMODE)-1);  
   while(espReplyIsSubstring(rep_OK,STRLEN(rep_OK)-1)==0){ 
            strSendUART2(_WAIT_CIPMODE,STRLEN(_WAIT_CIPMODE));
            HAL_Delay(300);         
            }            
   espReplyToUART2();
   espReplyClear();  

/*---------------------endESP8266 setting ---------------------*/  


            


            
  for(;;)
  {
      
     /*---------Connect to the server and transmit the data---------*/
          
    //Connecting to the server           
    strSendUART1(AT_CONNECT_TO_SERVER,STRLEN(AT_CONNECT_TO_SERVER));
    while(espReplyIsSubstring(rep_CONNECT,STRLEN(rep_CONNECT)-1)==0){ 
            strSendUART2(_WAIT_SERVERCON,STRLEN(_WAIT_SERVERCON));
            HAL_Delay(100);         
            }
   espReplyToUART2();
   espReplyClear();  
            
   // CIPMODE (uart<->WiFi) gets ready to start
   strSendUART1(AT_CIPSEND,STRLEN(AT_CIPSEND));  
   while(espReplyIsSubstring(rep_CIPSEND,STRLEN(rep_CIPSEND)-1)==0){ 
            strSendUART2(_WAIT_CIPSEND,STRLEN(_WAIT_CIPSEND));
            HAL_Delay(100);         
            }            
   espReplyToUART2();
   espReplyClear(); //NEWLINE   
   strSendUART2(NEWLINE,STRLEN(NEWLINE));
            
////////////////
osMutexWait(uart2Mutex02Handle, osWaitForever);               
uint16_t payloadlen =sprintf((char *)payload,"{\n\"d\":{\n\"myName\":\"STM32\",\n\"temp (C)\": %.2f\n}\n}",temperature); // 
osMutexRelease(dataMutex01Handle);

            
uint16_t len = MQTTSerialize_connect(buf, buflen, &data); 
len += (uint16_t)MQTTSerialize_publish(buf + len, buflen - len, 0, 0, 0, 0, topicString, payload, payloadlen);
len += MQTTSerialize_disconnect(buf + len, buflen - len);

strSendUART2(NEWLINE,STRLEN(NEWLINE));            
strSendUART2(buf,len); 
strSendUART2(NEWLINE,STRLEN(NEWLINE));
           
   strSendUART1(buf,len);  
   HAL_Delay(200);            
////////////////
     
   strSendUART1(AT_CIPMODECLOSE,STRLEN(AT_CIPMODECLOSE));  //CIPMODE close   
     HAL_Delay(200);    
            
/*---------end Connect to the server and transmit the data---------*/  
 
  }
  /* USER CODE END serverThread2 */
}




/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM3 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM3) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
